
struct SPOT_SPLIT_CONF
{
	ULONG nRects;
	SIZE BoundSizel;
	RECT rect[36];
};


//忙式忖
//戌式戎

SPOT_SPLIT_CONF const view_1 = {
	1,
	{1,1},
	{
		{0,0,1,1},
	}
};

//忙式成式忖
//戍式托式扣
//戌式扛式戎

SPOT_SPLIT_CONF const view_4 = {
	4,
	{2,2},
	{
		{0,0,1,1},
		{1,0,2,1},
		{0,1,1,2},
		{1,1,2,2},
	}
};

//忙式式式式式成式式忖
//弛          戍式式扣
//戍式式成式式托式式扣
//戌式式扛式式扛式式戎

SPOT_SPLIT_CONF const view_6={
	6,
	{3,3},
	{
		{0,0,2,2},

		{2,0,3,1},
		{2,1,3,2},

		{0,2,1,3},
		{1,2,2,3},
		{2,2,3,3},
	}

};

//忙式式成式式成式式忖
//戍式式托式式托式式扣
//戍式式托式式托式式扣
//戌式式扛式式扛式式戎

SPOT_SPLIT_CONF const view_9={
	9,
	{3,3},
	{
		{0,0,1,1},
		{1,0,2,1},
		{2,0,3,1},

		{0,1,1,2},
		{1,1,2,2},
		{2,1,3,2},

		{0,2,1,3},
		{1,2,2,3},
		{2,2,3,3},
	}

};

//忙式式式式式成式式式式式忖
//弛          弛          弛
//戍式式成式式托式式成式式扣
//戍式式托式式托式式托式式扣
//戌式式扛式式扛式式扛式式戎

SPOT_SPLIT_CONF const view_10 = {
	10,
	{4,4},
	{
		{0,0,2,2},
		{2,0,4,2},

		{0,2,1,3},
		{1,2,2,3},
		{2,2,3,3},
		{3,2,4,3},

		{0,3,1,4},
		{1,3,2,4},
		{2,3,3,4},
		{3,3,4,4},
	}
};

//忙式式成式式成式式成式式忖
//戍式式托式式扛式式托式式扣
//戍式式扣          戍式式扣
//戍式式托式式成式式托式式扣
//戌式式扛式式扛式式扛式式戎

SPOT_SPLIT_CONF const view_13 ={
	13,
	{4,4},
	{
		{1,1,3,3},

		{0,0,1,1},
		{1,0,2,1},
		{2,0,3,1},
		{3,0,4,1},

		{0,1,1,2},
		{3,1,4,2},

		{0,2,1,3},
		{3,2,4,3},

		{0,3,1,4},
		{1,3,2,4},
		{2,3,3,4},
		{3,3,4,4},
	}
};


//忙式式成式式成式式成式式忖
//戍式式托式式托式式托式式扣
//戍式式托式式托式式托式式扣
//戍式式托式式托式式托式式扣
//戌式式扛式式扛式式扛式式戎

SPOT_SPLIT_CONF const view_16={
	16,
	{4,4},
	{
		{0,0,1,1},
		{1,0,2,1},
		{2,0,3,1},
		{3,0,4,1},

		{0,1,1,2},
		{1,1,2,2},
		{2,1,3,2},
		{3,1,4,2},

		{0,2,1,3},
		{1,2,2,3},
		{2,2,3,3},
		{3,2,4,3},

		{0,3,1,4},
		{1,3,2,4},
		{2,3,3,4},
		{3,3,4,4},
	}
};

//忙式式式式式式式式成式式式式式式式式忖
//弛                弛				  弛
//弛                弛                弛
//戍式式成式式成式式托式式成式式成式式扣
//戍式式托式式托式式托式式托式式托式式扣
//戍式式托式式托式式托式式托式式托式式扣
//戌式式扛式式扛式式扛式式扛式式扛式式戎

SPOT_SPLIT_CONF const view_20={
	20,
	{6,6},
	{
		{0,0,3,3},
		
		{3,0,6,3},
		
		{0,3,1,4},
		{1,3,2,4},
		{2,3,3,4},
		{3,3,4,4},
		{4,3,5,4},
		{5,3,6,4},

		{0,4,1,5},
		{1,4,2,5},
		{2,4,3,5},
		{3,4,4,5},
		{4,4,5,5},
		{5,4,6,5},

		{0,5,1,6},
		{1,5,2,6},
		{2,5,3,6},
		{3,5,4,6},
		{4,5,5,6},
		{5,5,6,6},
	}
};

//忙式式成式式成式式成式式成式式忖
//戍式式托式式托式式托式式托式式扣
//戍式式托式式托式式托式式托式式扣
//戍式式托式式托式式托式式托式式扣
//戍式式托式式托式式托式式托式式扣
//戌式式扛式式扛式式扛式式扛式式戎

SPOT_SPLIT_CONF const view_25={
	25,
	{5,5},
	{
		{0,0,1,1},
		{1,0,2,1},
		{2,0,3,1},
		{3,0,4,1},
		{4,0,5,1},
				
		{0,1,1,2},
		{1,1,2,2},
		{2,1,3,2},
		{3,1,4,2},
		{4,1,5,2},
		
		{0,2,1,3},
		{1,2,2,3},
		{2,2,3,3},
		{3,2,4,3},
		{4,2,5,3},
		
		{0,3,1,4},
		{1,3,2,4},
		{2,3,3,4},
		{3,3,4,4},
		{4,3,5,4},
		
		{0,4,1,5},
		{1,4,2,5},
		{2,4,3,5},
		{3,4,4,5},
		{4,4,5,5},
	}
};

//忙式式成式式成式式成式式成式式成式式忖
//戍式式托式式托式式托式式托式式托式式扣
//戍式式托式式托式式托式式托式式托式式扣
//戍式式托式式托式式托式式托式式托式式扣
//戍式式托式式托式式托式式托式式托式式扣
//戍式式托式式托式式托式式托式式托式式扣
//戌式式扛式式扛式式扛式式扛式式扛式式戎

SPOT_SPLIT_CONF const view_36={
	36,
	{6,6},
	{
		{0,0,1,1},
		{1,0,2,1},
		{2,0,3,1},
		{3,0,4,1},
		{4,0,5,1},
		{5,0,6,1},

		{0,1,1,2},
		{1,1,2,2},
		{2,1,3,2},
		{3,1,4,2},
		{4,1,5,2},
		{5,1,6,2},

		{0,2,1,3},
		{1,2,2,3},
		{2,2,3,3},
		{3,2,4,3},
		{4,2,5,3},
		{5,2,6,3},

		{0,3,1,4},
		{1,3,2,4},
		{2,3,3,4},
		{3,3,4,4},
		{4,3,5,4},
		{5,3,6,4},

		{0,4,1,5},
		{1,4,2,5},
		{2,4,3,5},
		{3,4,4,5},
		{4,4,5,5},
		{5,4,6,5},

		{0,5,1,6},
		{1,5,2,6},
		{2,5,3,6},
		{3,5,4,6},
		{4,5,5,6},
		{5,5,6,6},
	}
};
